[
	[
		"Hack:Brunel",
		[
			[
				0,
				"I attended my first hackathon, which was held at "
			],
			[
				1,
				"https://www.brunel.ac.uk/",
				"Brunel University"
			],
			[
				0,
				" in Uxbridge, London. With Hack:Brunel being my first hackathon, I wasn't quite sure what to expect; was I to do good, or not? I went there with other students from my university, whom were also members of the Solent Computing Society. We all arrived very early in the morning outside our university, ready and eager to have fun and get work done. Once we all met up together, we then travelled to Uxbridge, not without a quick stop off at the motorway services to get some food. Upon arrival to Brunel University, we were raring to go and get to work; however, we arrived a bit to early, so we had to wait for the other participants to arrive, but this worked out in our benefit, as we were able to split into smaller teams and brainstorm ideas for us to make for the event.\nOnce the event started, my team reviewed all of our existing ideas and decided to go along with the idea which fixes the problems for us at our society, as typically there are struggles when thinking of new and interesting things to do. So we set out to create a responsive web based application which finds an activity for you to do based upon specified search criteria. When creating the application, we originally thought that we could use Google maps to gather information of places nearby, however we soon discovered that this would be a paid service per API request, so we decided to create a localized dataset of places - instead of relying on third parties.\nFor the project I was tasked with the creation of the application, which for me included creating a responsive front-end interface; this undertook many iterations, however with suggestions from our team we came to the final design, and I built and laid out the elements and created a responsive design language for the application. Next came the inclusion of JavaScript to make the page interactive, with this I had a realisation, with the JavaScript actions operating with the application there was only instantaneous updates/refreshed to the display, so I had the idea to create and implement transitions between each page of the application, this allows the application to move and dynamically resize to fit to content in a seamless yet beautiful way, this resulted in the application looking much more user friendly and intuitive as an added benefit was that with the movement between transitions actually helped show that back-end operations were occurring, which would further help the user understand what was happening when the application was running.\nWith the completed version of the application, it was time to present, so me and a fellow teammate went up on stage to promote our application \"Wheel\" was the name we gave to it, and I came up with our team tag line of \"we are reinventing the wheel\". For the presentation it was originally meant to be a 50/50 split in talk time between both of us on stage, but due to the amount of content that we crammed into our presentation it was only my team mate that was able to talk. Once all of the teams had presented it was time for judging... To our joyful responses, we was told that we came in second place; and we each won a prize. Overall, I'd say my first hackathon experience went very well, and I am looking forward to more. To celebrate we even used our application to find a nearby pub, where some of the others got a drink in celebration. However, I was rather tired after the event, so after we left and got back, I went to sleep, as a big part of hackathons which I learnt was the lack of sleep which accumulates with them.\nHowever, overall I had a very fun time, and I am looking forward to more events like this in the future!"
			]
		],
		[
			"hackathons"
		],
		1572199200
	],
	[
		"Kerbspace",
		[
			[
				0,
				"My second hackathon was in central London, and was run by a subset of "
			],
			[
				1,
				"https://www.ford-mobility.eu/",
				"Ford Mobility"
			],
			[
				0,
				" and the overall task was to create an application that used their brand new Kerbspace API. For us (team Solent) went in with high spirits, and a "
			],
			[
				1,
				"https://redbull.com/",
				"Red Bull™"
			],
			[
				0,
				" sponsorship - hence our creation of the \"Tower of Red Bull\". Upon arrival, our main idea was to create an application that would used facial recognition to detect the users of the app when driving, and then find the perfect place to park - based on their preferences - by using the Kerbspace API. Development started off slowly as we had to learn how the API worked, and what it could do on our own, which was rather a big struggle for us, as we essentially had to learn it from the ground up, without any knowledge of what it could do or how to do it.\nWith gaining a basic understanding of the API, we were able to create a prototype which filtered the response from the API with the service written in Python to form a rudimentary server, the data was then provided to a local application, that rendered the location data for an augmented reality view for the user to view in a mobile viewport. With this basic working prototype application, we then went off to present what we have done. However, when presenting we was plagued with issues such as: facial recognition failure, and hardware failure; I fear that it could be said that we struggled from our own success. Hence resulting, in us not winning this competition, but we left with a spring in our step, and set off back to Southampton."
			]
		],
		[
			"hackathons"
		],
		1575230400
	],
	[
		"Hack The South",
		[
			[
				0,
				"My third hackathon was hosted at the nearby "
			],
			[
				1,
				"https://www.southampton.ac.uk",
				"University of Southampton"
			],
			[
				0,
				", it was there only after a short cycle journey I had arrived, and was anticipating the arrivals of my teammates. At this hackathon we split of into smaller teams, and started brainstorming ideas of what it was that we could create within the 24 hour time frame; we came up with a few ideas, but the one, that we really took hold to was a property fault management system, that used blockchain technologies to log tenant requests (tickets), which were then automatically filtered by what the landlord had specified that they would be willing to accommodate to - for an abundance of reasons - and if any tradesmen met the criteria would then be assigned to the tenant's ticket request.\nThis idea seemed really good for us, as it seemed to be an idea that had not been replicated elsewhere. We started off making the application, this included servers, databases, as well as a client based application. The server and databases were handled in unison, and the MongoDB database was access by the Mongoose API from the Node.js server, this allowed us to query the data from the database collections, and allowed us to further mimic and fine-tune what the data to be sent to the client would be, in this case the server filtered out the distance that a tradesman would be willing to commute, based among query parameters of the longitude or latitude of the property address. This allowed us to further customize how we - as a team - would encompass the types of data that would be shown. The client interface was originally written within the Angular framework, but we decided to move to the Ionic framework, to improve the consistency of the interface; and was used to relay the data that was generated by the Node.js server. We then set of to select a name for the application, which was decided to be called \"DROID\". With this we had a working prototype, and we went off to present our application to the other teams that were at the event.\nOur presentation went fairly well, although we was cut off due to the time limitations, of which we exceeded due to the amount of information that we tried to cram into the presentation; which was not ideal, although we was able to show off a demo of our application, which we were however pleased about. After the remaining teams presented it was time for judging, and once the judges returned back with their selection of winners, we all collectively waited in anticipation, each eager to hear the results. Needless to say we were disappointed with the outcome, as we did not win; but we were happy with what we had made in the process, and shall take this experience along with us into future projects."
			]
		],
		[
			"hackathons"
		],
		1581274800
	],
	[
		"President elect",
		[
			[
				0,
				"I have been elected President of the Solent Computing Society, and I shall undertake the position for the next academic year. I was elected due to my broad appeal throughout the society, as I had been engaging in multiple events, whilst building strong relationships with the society members. As President-elect I will have to wait until the handover date, which will be in August of this year (2020); and upon becoming President of the society, I will assist in making the society better for all members, whilst trying to increase morale and engagement between its members. I hope in the coming year of my Presidency, that I can leave a lasting impression on the society's members, both: new, and old. Simply put, I am going to do my utmost best in making this society: inclusive, engaging, and enjoyable; as much as I possibly can!\nAlso, I thank all who voted for me to be President of the Solent Computing Society."
			]
		],
		[
			"personal",
			"solent",
			"computing_society"
		],
		1588190460
	],
	[
		"I am now a society President",
		[
			[
				0,
				"Well, I am now President of the Solent Computing Society. After a few months since the election, I am now in the top position of the Solent Computing Society, and I shall use this authority to build up meaningful relations between society members and other parties. It is an honour being elected for this position by other like-minded people, as it shows my worth as part of a team, and as a leader. I will make sure that I will do my utmost best, for the benefit of the Solent Computing Society, and anyone that crosses paths with myself, and the society."
			]
		],
		[
			"personal",
			"solent",
			"computing_society"
		],
		1596240000
	],
	[
		"Royal Hackaway V4",
		[
			[
				0,
				"Myself and my teammates, along with some other members of the Solent Computing Society attended "
			],
			[
				1,
				"https://royalhackaway.com/",
				"Royal Hackaway V4"
			],
			[
				0,
				"; this was a virtual hackathon, so all of us had to attend virtually from our homes. This made the development of the project rather cumbersome; as although we utilized the standard technology stack which we use - almost daily - the issue of communication yielded an inconvenience; however we prevailed.\nFor our project, my team had decided to create a database technology; the idea for the structure of the database, was my own, and the idea had actually come to mind a few weeks prior to the event. The design of this database, implements a skip amount, to define the gaps between elements; this is a useful strategy, as it allows for smaller file sizes whilst still enforcing the structure of the database. But what would we name this database technology? After some debate, we decided on calling it FlitDB, as the word flit is defined as to \"move swiftly and lightly\", which we believe fits in perfectly with the structure of this database technology, as the introduction of a skip amount yields a swift read time of the database. With that in mind, the database mostly revolves around the ability for its structure to be reconstructed upon the reading and writing of its values. By having instructions embedded into the literal structure of the database, the execution at runtime calculates the overall sizing, and ranges of the data stored in the database, resulting in a small size for the database interpretation library, as well as the database file size as well.\nThe language that we chose to develop the database technology in was written in C++ as we wanted to have a fast and performant library, which could be dynamically linked to; by other applications. Myself, being the only member of my team that had any experience in developing with C++, had to teach the other members of the team about all the quirks of the syntax of C++, this proved a fun experience as I enjoyed helping the other members learn the language. Throughout the development of the project, the limited time frame did present some issues with how much we could achieve, in a single weekend; however, we reached the submission time with some working functions, which: read, and write; to the database. Once we submitted the project, the dreaded wait for the review of all the submissions ocurred... After a few hours the judging had finished. Unsure of our position, in relation to the results; we watch the winning teams be presented - one after the other; all except one of the result had been given out. The only award left to give was the \"overall winner\" of the entire event. Suddenly, our project name was read out; with the branding of being the \"overall winners\" of the entire event. We were ecstatic, all of our hard work had paid off. Our team were winners; and we all had won an assortment of prizes, to merit our hard work. Overall the event was a fun, and interesting competition, I know that we all finished the event with the glee of being winners, and we all hope to attend, and compete in many more events like this.\nLater, "
			],
			[
				1,
				"https://www.solent.ac.uk/",
				"Solent University"
			],
			[
				0,
				" decided to publish an article, about our winnings:\n"
			],
			[
				1,
				"https://www.solent.ac.uk/news/solent-students-win-first-place-at-royal-hackaway",
				"https://www.solent.ac.uk/news/solent-students-win-first-place-at-royal-hackaway"
			]
		],
		[
			"hackathons"
		],
		1612781710
	],
	[
		"FlitDB 1.0 release",
		[
			[
				0,
				"My first project to have a "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/releases/tag/v1.0",
				"production 1.0 release"
			],
			[
				0,
				".\nAfter many months of work, and countless rewrites of functional operations, I have finally released "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" at a 1.0 release. "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" started as a need to have a way to store data in a tiny environment, and whilst the need for that dissipated, the project had not. The "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" project started as a Hackathon entry, where it won first place; by all means, what was submitted as our project was not even close to production ready, and also had many issues in - due to the 24 hour window of development of the competition - but the judges had seen real potential in the project, and awarded us first place. Being comfortable with first place wasn't enough for me, I wanted to do more, I wanted to see "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" be useful and fully functional, so I kept working on it. I started by rewriting it in pure C, as originally it started as a C++ project, but I felt that the C++ linkage would provide issues for people attempting to embed the project within any C projects - hence a full C compatible rewrite was needed. I learnt a lot about C during this process, as although the project was written in C++, I was fairly new to that language; but to me, C was something that I had never explicitly worked with; this originally proved difficult, as certain conventions from many other languages that I had worked with were essentially non-existent, or completely different to how I would have expected them to be. Alas, I persevered and stuck to it, this proved extremely beneficial to me, as I ended up researching about almost everything that C had to offer, and I really started to like it. I liked it so much that I started to pivot any other projects that I worked on towards C. After some time, the project started to have a more cohesive structure, and allowed for the testing of it on different platforms, as initially "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" was only compatible with Linux, but after removing Linux syscalls used for reading and writing, I replaced them with the standard conventions that libc used, this proved very beneficial as it allowed for compilation on MacOS systems; which amazed me, as I never imagined that my own project would be cross platform; but here I was writing code that could be compiled and executed on both systems. A few more months had passed, and more useful features were added, along with fixing and optimizing the allocation of memory, etc.\nFast forward to today, I was extremely happy to release "
			],
			[
				1,
				"https://github.com/bradley499/flitdb/",
				"FlitDB"
			],
			[
				0,
				" at 1.0, after many months of work, I couldn't be happier with the way that the project has ended up; by all means I wish to continue working on it in the future, but this milestone, is something that I am very proud to have reached."
			]
		],
		[
			"personal",
			"flitdb"
		],
		1627743012
	]
]